
{
  "VersionDropdown": {
    "type": "select",
    "label": "R_version",
    "help": "If you have a preferred R version you want to use, you can select it in the dropdown, otherwise, it will use the default R version. NOTE: R_tamu is a wrapper araound R with a large number of peopular packages already installed for your convenience. R_tamu also sets up the environment for the user to install more packages",
    "name": "version",
    "options": [
      {
        "value": "4.2.2",
        "label": "R_tamu/4.2.2"
      }
    ]
  },

  "mainscriptPicker": {
    "type": "picker",
    "label": "Main R script",
    "name": "mainscript",
    "remoteLabel": "local",
    "localLabel": "cluster",
    "showFiles": "True",
    "help" : "Here you can specify the R script you want to execute. You can either select it from a location on ACES (select cluster) or upload it from your local machine (local).If you don't select a file here, you can still manually enter it in the preview window.",
    "files": "True"
  },

   "RpathPicker": {
    "type": "picker",
    "label": "Add R_LIBS_USER path",
    "name": "rlibs",
    "help":"OPTIONAL: If you have any local R packages that will be used by this R job, you can select the directory that contains these packages here. Note, the packages in this path much exactly match the R version and toolchain selected for this Job. Use this option with care. R_tamu also sets up R_LIBS and R_LIBS_USER paths. This is the recommended way to install and access packages.",
    "localLabel": "select"
  },
  
  "fileUploader": {
    "type": "uploader",
    "label": "Upload files/data)",
    "help":"If your job uses any additional files, e.g. R scripts, or input data, that are stored on your local machine,  you can upload them here." 
  },

  "ParallelDependDropdown": {
    "type": "select",
    "label": "Does your R script create a parallel cluster",
    "help": "If your code uses any of the parallel packages (e.g. 'doParallel', 'SNOW')  and/or parallel constructs (e.g. foreach %dopar%). You can select here how the R code creates the paralel cluster. The most common parallel clusters are SOCK or MPI. If your code uses a different type of parallel cluster, select OTHER. If you are not sure if your code is using any parallel techniques, just select NONE or leave it blank.",
    "name": "parallel",
    "options": [
      {
        "value": "none",
        "label": "NONE"
      },
      {
        "value": "sock",
        "label": "SOCK"
      },
      {
        "value": "mpi",
        "label": "MPI"
      },
      {
        "value": "other",
        "label": "OTHER"
      }
    ]
  },

  "cores": {
    "type": "number",
    "label": "#Workers in SOCK cluster",
    "help":"Enter the number of workers used in the SOCK cluster. Note, this value must match the value for cluster size in your R code. SOCK clusteers are limited to single nodes, so the number of workers cannot exceed 96",
    "name": "cores",
    "value": "1",
    "condition": "ParallelDependDropdown.sock"
  },
  
  "coresmpi": {
    "type": "number",
    "label": "#Workers in MPI cluster",
    "help":"Enter the number of workers used in the MPI cluster. Note, this value must match the value for cluster size in your R code.",
    "name": "cores",
    "value": "1",
    "condition": "ParallelDependDropdown.mpi"
  },

  "coresother": {
    "type": "number",
    "label": "#Workers",
    "help":"Enter the number of workers useed for parallel processing. Note, this value must match the value in your R code.",
    "name": "cores",
    "value": "1",
    "condition": "ParallelDependDropdown.other"
  },

  "memory": {
    "type": "unit",
    "label": "Memory",
    "help": "OPTIONAL: provide the total amount of memory you esttimate the job needs. It's best to be conservative and request more. If your job will try to use more memory than requested, your job will be killed immediately and you might loose all intermediate results. If you don't enter any value, composer will use a default value.",
    "name": "memory",
    "units": [
      {
        "label": "GB",
        "value": "G"
      }
    ]
  },
  
  "Walltime": {
    "type": "time",
    "label": "Expected run time",
    "help": "OPTIONAL: provide the time you estimate the job will need. It's best to be conservative when requesting walltime. If your job exceeds the requested walltime, your job will be killed immediately and you might loose all intermediate results. If you don't enter a value, composer will use a default value of 2 hours",
    "name": "walltime",
    "value": ""
  }
}
